app/controllers/spends_controller.rb

INSERT INTO "spends" ("points", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["points", 50], ["user_id", 2], ["created_at", "2022-01-08 01:25:53.445082"], ["updated_at", "2022-01-08 01:25:53.445082"]]
---
    def create
        @spend = Spend.create(spend_params)
        @spend.user_id = params[:user_id]
        if @spend.save

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = ? AND "transactions"."redeemed" = ? ORDER BY "transactions"."timestamp" ASC  [["user_id", "1"], ["redeemed", 0]]
UPDATE "transactions" SET "redeemed" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["redeemed", 1], ["updated_at", "2022-01-08 22:40:42.414998"], ["id", 4]]
UPDATE "transactions" SET "remainder" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["remainder", 300], ["updated_at", "2022-01-08 22:40:42.418180"], ["id", 1]]
INSERT INTO "transactions" ("payer", "points", "created_at", "updated_at", "user_id", "redeemed") VALUES (?, ?, ?, ?, ?, ?)  [["payer", "MILLER COORS"], ["points", -5300], ["created_at", "2022-01-08 22:40:42.422084"], ["updated_at", "2022-01-08 22:40:42.422084"], ["user_id", "1"], ["redeemed", 1]]
INSERT INTO "transactions" ("payer", "points", "created_at", "updated_at", "user_id", "redeemed") VALUES (?, ?, ?, ?, ?, ?)  [["payer", "DANNON"], ["points", -200], ["created_at", "2022-01-08 05:41:06.231968"], ["updated_at", "2022-01-08 05:41:06.231968"], ["user_id", "1"], ["redeemed", 1]]
UPDATE "transactions" SET "remainder" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["remainder", 6000], ["updated_at", "2022-01-08 05:18:17.560513"], ["id", 4]]
---
    def makeTransactions(points, user_id)
        transactions = Transaction.where(user_id: user_id, redeemed: false).order(timestamp: :ASC)
        i=0
        hashTransactions=Hash.new(0)
        while(points > 0)
            pointsToRemove = transactions[i].remainder || transactions[i].points
                if (pointsToRemove <= points)
                    hashTransactions[transactions[i].payer]+= pointsToRemove

                    points -= pointsToRemove
                    transactions[i].update(:redeemed=> true)
                else
                    hashTransactions[transactions[i].payer]+= points
                    transactions[i].update(:remainder => pointsToRemove - points)
                    points = 0
                end
            i+=1;
        end
        hashTransactions.each do |key, value|
            @transaction = Transaction.create(:points => (-1*value), :user_id=> user_id, :payer=>key, :redeemed=> true)
            if @transaction.save