app/controllers/spends_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = ?  [["user_id", "2"]]
---
    def makeTransactions(points, user_id)
        transactions = Transaction.where(user_id: user_id)