app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("payer", "points", "created_at", "updated_at", "user_id", "redeemed", "timestamp") VALUES (?, ?, ?, ?, ?, ?, ?)  [["payer", "lee"], ["points", -100], ["created_at", "2022-01-08 03:55:38.740124"], ["updated_at", "2022-01-08 03:55:38.740124"], ["user_id", "1"], ["redeemed", 1], ["timestamp", "2020-11-02"]]
---
    def create
        @transaction = Transaction.create(transaction_params)
        @transaction.user_id = params[:user_id]
        if @transaction.save

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."user_id" = ? LIMIT ?  [["user_id", "2"], ["LIMIT", 1]]
---
    def index
        @transactions = Transaction.where(user_id: params[:user_id])