app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "\"demo1\""], ["created_at", "2022-01-07 04:09:06.569223"], ["updated_at", "2022-01-07 04:09:06.569223"]]
---
    def create
        @user = User.create(user_params)

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = ?  [["user_id", "2"]]
---
    def show
        @balance = balance(Transaction.where(user_id: params[:id]))